# Задание 1

# x = int(input("Введите число №1: "))
# y = int(input("Введите число №2: "))
# z = int(input("Введите число №3: "))
# print("Сумма чисел: ")
# print(x + y + z)
# print("Произведение чисел: ")
# print(x * y * z)

# Задание 2

# x = int(input("Зарплата за месяц: "))
# y = int(input("Сумма месячного платежа по кредиту: "))
# z = int(input("Задолженность за коммунальные услуги: "))
# print("Остаток зарплаты: ")
# print(x - y - z)

# Задание 3

# d1 = int(input("Введите длину диагонали d1, см: "))
# d2 = int(input("Введите длину диагонали d2, см: "))
# print("Площадь ромба, см2")
# print(d1 * d2 / 2)

# Задание 4

# print("to be\nor not\nto be")

# Задание 5

print('"Life is what happens')
print("      when")
print("          you’re busy making other plans”")
print("                                      John Lennon.")