# Задание 1

# x = int(input("Введите ваш возраст: "))
# if 0 <= x < 12:
#     print("Вы ребенок")
# elif 12 <= x < 18:
#     print("Вы подросток")
# elif 18 <= x < 60:
#     print("Вы взрослый")
# else:
#     print("Вы пенсионер")

# Задание 2

# x = int(input("Введите номер клавиши: "))
# if x == 1:
#     print("!")
# elif x == 2:
#     print("@")
# elif x == 3:
#     print("#")
# elif x == 4:
#     print("$")
# elif x == 5:
#     print("%")
# elif x == 6:
#     print("^")
# elif x == 7:
#     print("&")
# elif x == 8:
#     print("*")
# elif x == 9:
#     print("(")
# elif x == 0:
#     print(")")
# else:
#     print("Такой клавиши не существует")

# Задание 3

# x = int(input("Введите трехзначное число: "))
# x1 = x % 10
# x2 = x // 10
# x3 = x2 % 10
# x4 = x2 //10
# if x1 != x3 != x4:
#     print("Одинаковых цифр нет")
# else:
#     print("Одинаковые цифры есть")

# Задание 4

# x = int(input("Введите год: "))
# if x % 4 != 0:
#     print("Год обычный")
# elif x % 4 == 0:
#     if x % 100 != 0:
#         print("Год високосный")
#     elif x % 100 == 0:
#         if x % 400 == 0:
#             print("Год високосный")
#         else:
#             print("Год обычный")
#     else:
#         print()
# else:
#     print()

# Задание 5

# x = int(input("Введите пятиразрядное число: "))
# x1 = x % 10
# x2 = x // 10
# x3 = x2 % 10
# x4 = x2 // 10
# x5 = x4 % 10
# x6 = x4 // 10
# x7 = x6 % 10
# x8 = x6 //10
# if x1 == x8 and x3 == x7:
#     print("Число палиндром")
# else:
#     print("Число не палиндром")

# Задание 6

# x = int(input("Введите количество долларов США(USD): "))
# y = int(input("Введите валюту перевода(1 - EUR, 2 - UAH, 3 - AZN): "))
# if y == 1:
#     z = x * 0.93249
#     print(f"{z} EUR")
# elif y == 2:
#     z = x * 36.95
#     print(f"{z} UAH")
# elif y == 3:
#     z = x * 1.7
#     print(f"{z} AZN")
# else:
#     print("Ошибка!")

# Задание 7

# x = int(input("Введите сумму покупки, руб.: "))
# if 200 <= x < 300:
#     y = x * 0.97
#     print("Ваша скидка 3%")
#     print(f"Итого к оплате {y} руб.")
# elif 300 <= x < 500:
#     y = x * 0.95
#     print("Ваша скидка 5%")
#     print(f"Итого к оплате {y} руб.")
# elif x >= 500:
#     y = x * 0.93
#     print("Ваша скидка 7%")
#     print(f"Итого к оплате {y} руб.")
# else:
#     print("Ваша скидка 0%")
#     print(f"Итого к оплате {x} руб.")

# Задание 8

# L = int(input("Введите длину окружности, мм: "))
# P = int(input("Введите периметр квадрата, мм: "))
# d = L / 3.14
# a = P / 4
# if d <= a:
#     print("Окружность поместится в квадрат")
# else:
#     print("Окружность не поместится в квадрат")

# Задание 9

# print("Самая длинная река в мире?")
# print("1 - Амазонка")
# print("2 - Нил")
# print("3 - Миссисипи")
# x = int(input("Введите вариант ответа (1,2,3): "))
# score = 0
# if x == 1:
#     print("Ответ верный!")
#     score = score + 2
# else:
#     print("Ответ неверный!")
    
# print("Самая многочисленная страна в Европе?")
# print("1 - Турция")
# print("2 - Россия")
# print("3 - Германия")
# y = int(input("Введите вариант ответа (1,2,3): "))
# if y == 2:
#     print("Ответ верный!")
#     score = score + 2
# else:
#     print("Ответ неверный!")

# print("Самая маленькая страна в мире?")
# print("1 - Лихтенштейн")
# print("2 - Монако")
# print("3 - Ватикан")
# z = int(input("Введите вариант ответа (1,2,3): "))
# if z == 3:
#     print("Ответ верный!")
#     score = score + 2
# else:
#     print("Ответ неверный!")
# print(f"Вы набрали {score} очка(ов)")

# Задание 10

d = int(input("Введите дату (ДД): "))
m = int(input("Введите месяц (ММ): "))
y = int(input("Введите год (ГГГГ): "))
if m == 1 or 3 or 5 or 7 or 8 or 10:
    if d > 31:
        print("Данные введены не верно!")
    elif d == 31:
        print(f"01.{m + 1:02}.{y}")
    else:
        print(f"{d + 1:02}.{m:02}.{y}")
elif m == 4 or 6 or 9 or 11:
    if d > 30:
        print("Данные введены не верно!")
    elif d == 30:
        print(f"01.{m + 1:02}.{y}")
    else:
        print(f"{d + 1:02}.{m:02}.{y}")
elif m == 2:
    if y % 4 == 0 and y % 100 != 0 or y % 400 == 0:
        if d > 29:
            print("Данные введены не верно!")
        elif d == 29:
            print(f"01.{m + 1:02}.{y}")
        else:
            print(f"{d + 1:02}.{m:02}.{y}")
    else:
        if d > 28:
            print("Данные введены не верно!")
        elif d == 28:
            print(f"01.{m + 1:02}.{y}")
        else:
            print(f"{d + 1:02}.{m:02}.{y}")
elif m == 12:
    if d > 31:
        print("Данные введены не верно!")
    elif d == 31:
        print(f"01.01.{y + 1}")
    else:
        print(f"{d + 1:02}.{m:02}.{y}")
else:
    print("Данные введены не верно!")

